[
    {
        "title": "Dracula",
        "author": "Bram Stoker",
        "cover": "https://www.readandcobooks.co.uk/wp-content/uploads/dracula-stoker-9781447407461-cover.jpg",
        "synopsis": "Dracula is a novel by Bram Stoker, published in 1897. It tells the story of Count Dracula's attempt to move from Transylvania to England so he may find new blood and spread the undead curse, and of the battle between Dracula and a small group of people led by Professor Abraham Van Helsing."
    },
    {
        "title": "Interview with the Vampire",
        "author": "Anne Rice",
        "cover": "https://m.media-amazon.com/images/I/8147Hra+W3L._AC_UF894,1000_QL80_.jpg",
        "synopsis": "Interview with the Vampire is a 1976 gothic horror novel by Anne Rice. The story revolves around the vampire Louis de Pointe du Lac as he recounts his life story to a reporter, revealing his transformation into a vampire and his complicated relationship with his maker, Lestat."
    },{
        "title": "Let the Right One In",
        "author": "John Ajvide Lindqvist",
        "cover": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1327893384i/943402.jpg",
        "synopsis": "Let the Right One In is a 2004 horror novel by John Ajvide Lindqvist. It tells the story of a young boy named Oskar who befriends a mysterious girl named Eli, who is a vampire. The novel explores themes of friendship, bullying, and the moral implications of immortality."
    },
    {
        "title": "The Last Days of Jack Sparks",
        "author": "Jason Arnopp",
        "cover": "https://m.media-amazon.com/images/I/71Zk47taEOL._AC_UF894,1000_QL80_.jpg",
        "synopsis": "The Last Days of Jack Sparks is a 2016 horror novel by Jason Arnopp. The story follows Jack Sparks, a journalist who investigates paranormal phenomena. His research leads him to confront the darker side of the supernatural, including a deadly encounter with a vampire."
    },
    {
        "title": "Fevre Dream",
        "author": "George R.R. Martin",
        "cover": "https://m.media-amazon.com/images/I/71lSuCYqVxL._AC_UF894,1000_QL80_.jpg",
        "synopsis": "Fevre Dream is a 1982 horror novel by George R.R. Martin. Set in the 19th-century Mississippi River steamboat era, the novel combines historical fiction with supernatural horror, featuring a vampire antagonist who is both a ruthless killer and a charismatic leader."
    },
    {
        "title": "Salem's Lot",
        "author": "Stephen King",
        "cover": "https://m.media-amazon.com/images/I/81lNStGynNL._AC_UF894,1000_QL80_.jpg",
        "synopsis": "Salem's Lot is a 1975 horror novel by Stephen King. It tells the story of a small town in Maine that becomes plagued by vampires. The novel explores the impact of evil on a community and the battle between good and evil."
    },
    {
        "title": "Thirst",
        "author": "Christopher Pike",
        "cover": "https://m.media-amazon.com/images/I/61uz7qBSkaL._AC_UF894,1000_QL80_.jpg",
        "synopsis": "Thirst is a 1992 young adult horror novel by Christopher Pike. The story follows a teenage girl named Shari who discovers she is a vampire and must come to terms with her new identity while grappling with the consequences of her actions."
    },
    {
        "title": "The Historian",
        "author": "Elizabeth Kostova",
        "cover": "https://m.media-amazon.com/images/I/81r+L24AoZL._AC_UF894,1000_QL80_.jpg",
        "synopsis": "The Historian is a 2005 novel by Elizabeth Kostova. It blends historical fiction with horror as it traces the search for Dracula across Europe, following the story of a young woman who uncovers her father's past and the dark secrets of the vampire legend."
    }
]
