[
    "Find some mortal food and try to eat it. Points for how long you can keep it down.",
    "Send a mysterious, cryptic message to one of your friends, pretending it's from an unknown vampire elder.",
    "Prank call the highest-ranking vampire you can contact, and show us the results.",
    "Find the oldest vampire you know and try to explain a modern meme to them. Record it or show the screenshots.",
    "Display your familiarity with modern culture by speaking exclusively in memes for the next 15 minutes.",
    "Some time within the next week, start a blasphemous rumor. Don't let anyone know which gossip is true or false.",
    "Conduct a séance to contact the ghost of a famous vampire hunter (real or fictional) and stream it.",
    "Jump from a high floor of a building and try to land on your feet. Film it.",
    "Write a haiku about your adoration or hatred for someone present.",
    "Show the group your best karaoke!",
    "Switch roles with another person present. Try to mimic each other. Neither of you are free until the group decides you've done a good job.",
    "Impersonate another clan for the next 20 minutes. The group gets to vote on how convincing you are.",
    "Act your real age for the next 20 minutes. (e.g., an Elder could act old and use archaic language; an ancilla might suddenly forget how airplanes work, a fledgling becomes an incomprehensible meme machine, etc.)",
    "Feed from a type of mortal you've never fed from before and tell us how it goes.",
    "Convince or influence a mortal to do something ridiculous.",
    "Show the group the last 5 images in your camera roll.",
    "Send a picture of your fangs in chat.",
    "Text your sire or mentor and convince them you're in trouble.",
    "Find an old-fashioned outfit and wear it for the next 24 hours. Share a photo.",
    "Perform a dramatic reading of a famous speech or monologue, with full emotion and theatrics.",
    "Create and present a 1-minute skit about a day in the life of a vampire. Film it or do it live.",
    "Write a vampire-themed poem and recite it to the group.",
    "Post a video of you attempting to cook a traditional dish from a country of your choice. Bonus points for wearing themed attire.",
    "Have a conversation with someone as if you’re an old vampire who’s just discovered modern technology.",
    "Pretend you’re a vampire historian and give a 3-minute lecture on a random topic related to vampire lore.",
    "Send a voice message pretending to be a vampire giving advice to a mortal about life.",
    "Create a ‘vampire-themed’ TikTok or short video and share the link.",
    "Draw or digitally create a vampire-themed piece of art. Share your creation with the group.",
    "Come up with a unique vampire-themed conspiracy theory and present it to the group with as much detail as possible.",
    "Reenact a famous scene from a vampire movie or TV show. Post the video for everyone to see.",
    "Conduct a mock vampire court trial where you’re the judge, jury, and defendant. Record or live stream it.",
    "Design a ‘vampire-themed’ board game or card game. Share the rules and how it’s played.",
    "Compose and perform a short vampire-themed song or jingle. Share the recording with the group.",
    "Create a list of ‘vampire survival tips’ and present them as if you’re an expert.",
    "Do a live Q&A session where you answer questions as if you’re a vampire from a specific clan.",
    "Write a diary entry from the perspective of a vampire having a particularly bad night.",
    "Pretend you’re a vampire trying to blend in at a modern-day coffee shop. Describe your experience and how you interacted with the staff.",
    "Host a mock vampire ‘fashion show’ and show off your best vampire attire or accessories.",
    "Create and share a vampire-themed meme or comic strip. Make sure it’s humorous and engaging.",
    "Film yourself reading the most recent news headlines but with a vampire twist.",
    "Write a fictional social media post from the perspective of a vampire influencer. Share it with the group.",
    "Put together a vampire-themed scavenger hunt and challenge others to complete it. Share the clues and tasks."
]