[
    "What's the weirdest blood you've ever tasted? Did you like it? Be honest.",
    "What's the nastiest blood you've ever tasted, and why did you drink it?",
    "Let's be honest - what's your least favorite clan?",
    "What do you dislike the most about your own clan? Why?",
    "What do you think is the biggest misconception about your clan?",
    "If you had to switch clans for a week, which would you choose and why?",
    "What's the most annoying thing about Kindred outside your age group? (elders for neonates, neonates for elders)",
    "How old are you, really?",
    "If you could, what's the number one thing you would change about your sect?",
    "Which person present would you most like to bite, who you've never bitten before?",
    "Which person present do you think is most likely to commit diablerie? (Known diablerists don't count.)",
    "If you could bite any mortal celebrity, who would it be?",
    "Would you ever bite a lupine? Have you?",
    "Who's the last kindred you crushed on? Why didn't it work out?",
    "What's the most mortal-like thing you still enjoy doing, even though it serves no purpose?",
    "What do you miss the most about mortality?",
    "What do you regret about the way you died?",
    "Do you ever wish you'd died at a different age?",
    "What was the weirdest place you ever slept during the day?",
    "Who is your favorite vampire from pop culture?",
    "Which Kindred power do you secretly wish you had?",
    "What's the wildest thing you've ever done with a Kindred partner?",
    "Have you ever had a romance with a mortal? How did that work out?",
    "If you could make anyone in this group your ghoul for a month, who would it be and what would you make them do?",
    "What's the pettiest reason you've ever used Presence or Dominate on someone?",
    "Would you rather die by fire, sunlight, or decapitation?",
    "Talk about a time you came dangerously close to violating the Masquerade.",
    "Talk about a time you hurt or killed someone and regretted it.",
    "Talk about a memory from your past you would erase if you could.",
    "If you could have any historical figure as your sire, who would it be?",
    "If you could walk in the Sun for 24 hours, what would you do?",
    "What's your oldest physical possession? How old is it?",
    "What’s the most bizarre piece of vampire lore you’ve encountered that you actually believe?",
    "Quick! Someone present has to die, and you get to choose who it is. Who do you pick?",
    "What’s the most ridiculous thing you've ever done to impress someone?",
    "What’s something you’ve never told anyone because you’re embarrassed?",
    "What’s the biggest lie you’ve ever told, and did you get caught?",
    "If you could change one thing about your past, what would it be and why?",
    "What’s the most surprising thing you’ve learned about yourself recently?",
    "What’s a secret hobby or interest you have that no one knows about?",
    "What’s the worst trouble you’ve ever gotten into with your family?",
    "What’s something you wish you could do over, but can’t?",
    "What’s a guilty pleasure you’re not ashamed of?",
    "What’s a fear or phobia you have that you’ve never told anyone?",
    "What’s the most awkward situation you’ve ever been in?",
    "If you had to live in a different era, which one would you choose and why?",
    "What’s something you’ve always wanted to do but haven’t had the chance to yet?",
    "What’s the most embarrassing thing that’s ever happened to you at work or school?",
    "What’s a habit you have that you’re trying to break, and why?",
    "What’s something you find annoying that most people don’t?",
    "What’s a lie you’ve told to avoid hurting someone’s feelings?",
    "What’s a personal goal you’ve set for yourself that you’re struggling to achieve?",
    "What’s the most unusual or interesting job you’ve ever had?",
    "What’s a regret you have about a decision you made in a past relationship?",
    "What’s something you’ve done that you’re really proud of, but haven’t shared with anyone?",
    "What’s a belief you hold that others might find controversial?",
    "What’s the most unusual thing you’ve ever eaten, and did you like it?",
    "What’s the most significant change you’ve made in your life recently?",
    "What’s a skill or talent you have that you’re not particularly proud of?",
    "What’s something you’re really bad at but wish you were better at?",
    " is there anyone you will absolutely NOT feed from?"
]
